In [1]:
import numpy as np
import pandas as pd

In [2]:
sozluk1 = {"Isim": ["ahmet", "mehmet", "zeynep", "atil"],
           "Spor" : ["Kosu", "Yuzme", "Kosu", "basket"],
           "Kalori" : [100,200,300,400] }

In [3]:
dataframe1 = pd.DataFrame(sozluk1, index = [0,1,2,3])

In [4]:
dataframe1

     Isim    Spor  Kalori
0   ahmet    Kosu     100
1  mehmet   Yuzme     200
2  zeynep    Kosu     300
3    atil  basket     400

In [5]:
sozluk2 = {"Isim": ["osman", "levent", "atlas", "fatma"],
           "Spor" : ["Kosu", "Yuzme", "Kosu", "basket"],
           "Kalori" : [200,300,400,100] }

In [6]:
dataframe2 = pd.DataFrame(sozluk2, index = [4,5,6,7])

In [7]:
dataframe2

     Isim    Spor  Kalori
4   osman    Kosu     200
5  levent   Yuzme     300
6   atlas    Kosu     400
7   fatma  basket     100

In [8]:
sozluk3 = {"Isim": ["ayse", "mahmut", "duygu", "nur"],
           "Spor" : ["Kosu", "Yuzme", "badminton", "tenis"],
           "Kalori" : [400,100,200,500] }

In [9]:
dataframe3 = pd.DataFrame(sozluk3, index = [8,9,10,11])

In [10]:
dataframe3

      Isim       Spor  Kalori
8     ayse       Kosu     400
9   mahmut      Yuzme     100
10   duygu  badminton     200
11     nur      tenis     500

## concatenation

In [11]:
pd.concat([dataframe1,dataframe2,dataframe3], axis = 0)
# 3 farklı ama aynı kolon indexlerine sahip listeyi birleştirmemizi sağladı.
# axis = 0 yazmasak da olur. varsayılan olarak kolon bazlı listeliyor. Hatırlatma için ekledim.

      Isim       Spor  Kalori
0    ahmet       Kosu     100
1   mehmet      Yuzme     200
2   zeynep       Kosu     300
3     atil     basket     400
4    osman       Kosu     200
5   levent      Yuzme     300
6    atlas       Kosu     400
7    fatma     basket     100
8     ayse       Kosu     400
9   mahmut      Yuzme     100
10   duygu  badminton     200
11     nur      tenis     500

# merge

In [13]:
mergeSozluk1 = {"Isim": ["osman", "levent", "atlas", "fatma"],
           "Spor" : ["Kosu", "Yuzme", "Kosu", "basket"] }

In [14]:
mergeDataFrame1 = pd.DataFrame(mergeSozluk1)

In [15]:
mergeDataFrame1

     Isim    Spor
0   osman    Kosu
1  levent   Yuzme
2   atlas    Kosu
3   fatma  basket

In [18]:
mergeSozluk2 = {"Isim": ["osman", "levent", "atlas", "fatma"],
                "Kalori" : [400,100,200,500] }

In [19]:
mergeDataFrame2 = pd.DataFrame(mergeSozluk2)

In [20]:
mergeDataFrame2

     Isim  Kalori
0   osman     400
1  levent     100
2   atlas     200
3   fatma     500

In [23]:
pd.merge(mergeDataFrame1, mergeDataFrame2, on="Isim")
# Hangi kolon üstünden ortak işlem yapacaksak on parametresi ile eşle
# concatenation dan farkı: merge ile farklı koolon indeksli matrisler birleşebilir.

     Isim    Spor  Kalori
0   osman    Kosu     400
1  levent   Yuzme     100
2   atlas    Kosu     200
3   fatma  basket     500

In [33]:
#-----------------------------------------------------------------------
#
#-----------------------------------------------------------------------

In [26]:
maasSozluk = {"Isim": ["osman", "levent", "atlas", "fatma"],
              "Departman" : ["Yazilim", "Satis", "pazarlama", "Yazilim"],
              "Maas" : [400,100,200,500] }

In [27]:
maasDataFrame = pd.DataFrame(maasSozluk)

In [28]:
maasDataFrame

     Isim  Departman  Maas
0   osman    Yazilim   400
1  levent      Satis   100
2   atlas  pazarlama   200
3   fatma    Yazilim   500

In [30]:
maasDataFrame["Departman"].unique()
# tekrar eden dataları göstermez.

array(['Yazilim', 'Satis', 'pazarlama'], dtype=object)

In [31]:
maasDataFrame["Departman"].nunique()
# benzersiz, kaç farklı departman varsa sayısını basar.

3

In [34]:
maasDataFrame["Departman"].value_counts()
# hangi departmandan kaç eleman olduğunu verir.

Departman
Yazilim      2
Satis        1
pazarlama    1
Name: count, dtype: int64

In [36]:
def bruttenNete(maas):
    return maas * 0.66

maasDataFrame["Maas"].apply(bruttenNete)

# apply sayesinde, seçtiğim dataları fonksiyonda döndürebilirim.

0    264.0
1     66.0
2    132.0
3    330.0
Name: Maas, dtype: float64

In [37]:
maasDataFrame.isnull()
# Null değer varsa True, yoksa False döndürür

    Isim  Departman   Maas
0  False      False  False
1  False      False  False
2  False      False  False
3  False      False  False

In [44]:
#-----------------------------------------------------------------------
# PIVOT TABLE

In [68]:
puanVeri = {"Isim": ["ayse", "duygu", "nur", "ayse", "duygu", "nur"],
            "Spor" : ["Kosu", "badminton", "Kosu","Kosu","badminton","ok"],
            "Puan" : [40,10,50,60,90,30] }

In [69]:
IsimDF = pd.DataFrame(puanVeri)

In [70]:
IsimDF

    Isim       Spor  Puan
0   ayse       Kosu    40
1  duygu  badminton    10
2    nur       Kosu    50
3   ayse       Kosu    60
4  duygu  badminton    90
5    nur         ok    30

In [71]:
IsimDF.pivot_table(values = "Puan", index = ["Isim", "Spor"])
# Multindex yapmak amacımız değildi, mesela duygu badminton dan iki kez puan almış
# -bu puanların ortalamasını yazdı.

                 Puan
Isim  Spor
ayse  Kosu         50
duygu badminton    50
nur   Kosu         50
      ok           30

In [73]:
IsimDF.pivot_table(values = "Puan", index = ["Isim", "Spor"], aggfunc=np.max)
# aggfunc=np.max yaparak max değerleri çekti.
# varsayılan özelliği ortalama almaktır.

                 Puan
Isim  Spor
ayse  Kosu         60
duygu badminton    90
nur   Kosu         50
      ok           30